## 1- Imports

In [1]:
import pandas as pd
import numpy as np

## 2- DataFrame Titres et Entrées

In [2]:
df = pd.read_csv('allocine_films/data.csv')
df1 = pd.read_csv('allocine_films/films_data.csv')

In [3]:
df

                                  Titre              Entrées
0                              Novembre      592 681,429 138
1     Ant-Man et la Guêpe : Quantumania      735 356,437 550
2                            Stillwater       135 483,94 400
3                          Annie Colère        68 373,38 078
4                                Avatar  2 648 596,2 925 087
...                                 ...                  ...
7557            11'e 10 kala (10 to 11)                  794
7558                Seules sur la terre        81 274,50 760
7559                  Notes Laura Fiori                14,11
7560              Hollywood, California                   83
7561                  Aynehaye Rooberoo         14 181,7 222

[7562 rows x 2 columns]

In [4]:
df = df.dropna()

In [5]:
df

                                  Titre              Entrées
0                              Novembre      592 681,429 138
1     Ant-Man et la Guêpe : Quantumania      735 356,437 550
2                            Stillwater       135 483,94 400
3                          Annie Colère        68 373,38 078
4                                Avatar  2 648 596,2 925 087
...                                 ...                  ...
7557            11'e 10 kala (10 to 11)                  794
7558                Seules sur la terre        81 274,50 760
7559                  Notes Laura Fiori                14,11
7560              Hollywood, California                   83
7561                  Aynehaye Rooberoo         14 181,7 222

[7562 rows x 2 columns]

In [6]:
df['Entrées'] = df['Entrées'].str.replace(' ', '')
df[['Entrées_1', 'Entrées_2']] = df['Entrées'].str.split(',', expand=True)
df['Entrées_1'] = pd.to_numeric(df['Entrées_1'], errors='coerce').astype('Int64')
df['Entrées_2'] = pd.to_numeric(df['Entrées_2'], errors='coerce').astype('Int64')

In [7]:
df

                                  Titre          Entrées  Entrées_1  Entrées_2
0                              Novembre    592681,429138     592681     429138
1     Ant-Man et la Guêpe : Quantumania    735356,437550     735356     437550
2                            Stillwater     135483,94400     135483      94400
3                          Annie Colère      68373,38078      68373      38078
4                                Avatar  2648596,2925087    2648596    2925087
...                                 ...              ...        ...        ...
7557            11'e 10 kala (10 to 11)              794        794       <NA>
7558                Seules sur la terre      81274,50760      81274      50760
7559                  Notes Laura Fiori            14,11         14         11
7560              Hollywood, California               83         83       <NA>
7561                  Aynehaye Rooberoo       14181,7222      14181       7222

[7562 rows x 4 columns]

## 3- Choix entre Entrées_1 et Entrées_2

In [8]:
print(df[df['Entrées_1'] >= df['Entrées_2']])

                                  Titre        Entrées  Entrées_1  Entrées_2
0                              Novembre  592681,429138     592681     429138
1     Ant-Man et la Guêpe : Quantumania  735356,437550     735356     437550
2                            Stillwater   135483,94400     135483      94400
3                          Annie Colère    68373,38078      68373      38078
5                              Parasite  376842,231685     376842     231685
...                                 ...            ...        ...        ...
7555                     La Dame du jeu    48522,24336      48522      24336
7556                        Nowhere Man    48753,17961      48753      17961
7558                Seules sur la terre    81274,50760      81274      50760
7559                  Notes Laura Fiori          14,11         14         11
7561                  Aynehaye Rooberoo     14181,7222      14181       7222

[6614 rows x 4 columns]

In [9]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                          Titre          Entrées  Entrées_1  Entrées_2
4                        Avatar  2648596,2925087    2648596    2925087
6                     The Whale      65064,69274      65064      69274
10    LOL (Laughing Out Loud) ®    738734,806131     738734     806131
20                        Close      19030,82750      19030      82750
61                  Élémentaire    426818,537921     426818     537921
...                         ...              ...        ...        ...
7454                    Playoff         266,1530        266       1530
7480                   Subimago            21,24         21         24
7505       La venta del paraíso          332,388        332        388
7518                    Be Home            69,70         69         70
7524                 Honeymoons        1480,2323       1480       2323

[421 rows x 4 columns]

In [10]:
# Fonction personnalisée pour appliquer les conditions
def calc_entrées(row):
    if pd.notnull(row['Entrées_2']):
        if row['Entrées_2'] > 7 * row['Entrées_1']:
            return row['Entrées_2']
        else:
            return row['Entrées_1']
    return row['Entrées_1']

# Appliquer la fonction pour créer la nouvelle colonne 'Entrées_1ère_semaine'
df['Entrées_1ère_semaine'] = df.apply(calc_entrées, axis=1)

In [11]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                          Titre          Entrées  Entrées_1  Entrées_2  \
4                        Avatar  2648596,2925087    2648596    2925087
6                     The Whale      65064,69274      65064      69274
10    LOL (Laughing Out Loud) ®    738734,806131     738734     806131
20                        Close      19030,82750      19030      82750
61                  Élémentaire    426818,537921     426818     537921
...                         ...              ...        ...        ...
7454                    Playoff         266,1530        266       1530
7480                   Subimago            21,24         21         24
7505       La venta del paraíso          332,388        332        388
7518                    Be Home            69,70         69         70
7524                 Honeymoons        1480,2323       1480       2323

      Entrées_1ère_semaine
4                  2648596
6                    65064
10                  738734
20                   19030
61                  426818
...                    ...
7454                   266
7480                    21
7505                   332
7518                    69
7524                  1480

[421 rows x 5 columns]

In [12]:
df

,Titre,Entrées,Entrées_1,Entrées_2,Entrées_1ère_semaine
0,Novembre,"592681,429138",592681,429138,592681
1,Ant-Man et la Guêpe : Quantumania,"735356,437550",735356,437550,735356
2,Stillwater,"135483,94400",135483,94400,135483
3,Annie Colère,"68373,38078",68373,38078,68373
4,Avatar,"2648596,2925087",2648596,2925087,2648596
...,...,...,...,...,...
7557,11'e 10 kala (10 to 11),794,794,<NA>,794
7558,Seules sur la terre,"81274,50760",81274,50760,81274
7559,Notes Laura Fiori,"14,11",14,11,14
7560,"Hollywood, California",83,83,<NA>,83
7561,Aynehaye Rooberoo,"14181,7222",14181,7222,14181

## 4- DataFrame Titre et Entrées 1ère semaine

In [13]:
df = df[['Titre', 'Entrées_1ère_semaine']]

In [14]:
df

                                  Titre  Entrées_1ère_semaine
0                              Novembre                592681
1     Ant-Man et la Guêpe : Quantumania                735356
2                            Stillwater                135483
3                          Annie Colère                 68373
4                                Avatar               2648596
...                                 ...                   ...
7557            11'e 10 kala (10 to 11)                   794
7558                Seules sur la terre                 81274
7559                  Notes Laura Fiori                    14
7560              Hollywood, California                    83
7561                  Aynehaye Rooberoo                 14181

[7562 rows x 2 columns]

In [15]:
df['Titre'].value_counts()

Summertime                              3
Invasion                                3
Daddy Cool                              2
Le Paradis                              2
L'Enfant                                2
                                       ..
Fleur du désert                         1
Die Hard : belle journée pour mourir    1
La Loi du marché                        1
Coeurs ennemis                          1
Aynehaye Rooberoo                       1
Name: Titre, Length: 7485, dtype: int64

In [16]:
df[df['Titre']== 'Brothers']

         Titre  Entrées_1ère_semaine
5492  Brothers                   833
6836  Brothers                    46

In [17]:
duplicate_rows = df[df.duplicated(subset='Titre', keep=False)]
duplicate_rows

                 Titre  Entrées_1ère_semaine
60            Une nuit                 58679
64      Les Misérables                559378
80                Coco                948846
89    En eaux troubles                710798
90          Cendrillon                636418
...                ...                   ...
6959         Par amour                  4459
7044      Avant l'aube                   202
7063            Puzzle                 10038
7369           Holiday                   335
7408     Chacun sa vie                   125

[152 rows x 2 columns]

In [18]:
df[df['Titre']=='Coco']

     Titre  Entrées_1ère_semaine
80    Coco                948846
2697  Coco               1806263

In [19]:
df[df['Titre']=="Cendrillon"]

           Titre  Entrées_1ère_semaine
90    Cendrillon                636418
2514  Cendrillon                 38457

In [20]:
# Enlever les titres dupliqués en gardant celui avec le plus grand nombre d'entrées
df.drop_duplicates(subset='Titre', keep='last', inplace=True)

# Réinitialiser les index du DataFrame après la suppression des doublons
df.reset_index(drop=True, inplace=True)

/tmp/ipykernel_5373/3731102788.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates(subset='Titre', keep='last', inplace=True)

In [21]:
df

                                  Titre  Entrées_1ère_semaine
0                              Novembre                592681
1     Ant-Man et la Guêpe : Quantumania                735356
2                            Stillwater                135483
3                          Annie Colère                 68373
4                                Avatar               2648596
...                                 ...                   ...
7480            11'e 10 kala (10 to 11)                   794
7481                Seules sur la terre                 81274
7482                  Notes Laura Fiori                    14
7483              Hollywood, California                    83
7484                  Aynehaye Rooberoo                 14181

[7485 rows x 2 columns]

In [22]:
df[df['Entrées_1ère_semaine'] > 4000000]

                         Titre  Entrées_1ère_semaine
265  Bienvenue chez les Ch'tis               4378720

In [23]:
#df.to_csv('allocine_titre_entrees_gold.csv', index=False)

In [24]:
import pandas as pd

# Les titres des films que vous avez fournis
print(df.shape)
titres_films = [
    "Un Noël de folie !",
    "Sex fans des sixties",
    "Bronx à Bel Air",
    "Jonas Brothers : le concert événement 3D",
    "Smart People",
    'Demon Slayer : Kimetsu no Yaiba - En route pour le village des forgerons',
    'Oppenheimer',
    'Barbie',
    'Mission: Impossible – Dead Reckoning Partie 1',
    'Coco',
    'Jack et Julie'
]

# Supposons que vous ayez un DataFrame appelé "df" avec une colonne "Titre"
# Vous pouvez charger ou créer votre DataFrame ici
# Exemple :
# df = pd.read_csv('votre_fichier.csv')

# Vérifier si les titres des films existent dans le DataFrame
for titre_film in titres_films:
    if titre_film in df['Titre'].values:
        print(f"Le film '{titre_film}' YES.")
    else:
        print(f"Le film '{titre_film}' NO.")

(7485, 2)
Le film 'Un Noël de folie !' YES.
Le film 'Sex fans des sixties' NO.
Le film 'Bronx à Bel Air' NO.
Le film 'Jonas Brothers : le concert événement 3D' YES.
Le film 'Smart People' YES.
Le film 'Demon Slayer : Kimetsu no Yaiba - En route pour le village des forgerons' YES.
Le film 'Oppenheimer' NO.
Le film 'Barbie' NO.
Le film 'Mission: Impossible – Dead Reckoning Partie 1' YES.
Le film 'Coco' YES.
Le film 'Jack et Julie' YES.

# Nouveau scraping

In [25]:
df2 = pd.read_csv('allocine_films/data11.csv')

In [26]:
df2

,Titre,Semaine,Entrées
0,Marinette,07 au 14 juin 2023,"26 273,12 278"
1,Novembre,05 au 12 octobre 2022,"592 681,429 138"
2,Mission: Impossible - Rogue Nation,12 au 19 août 2015,"1 233 768,646 680"
3,Corsage,14 au 21 décembre 2022,"35 145,17 271"
4,Une belle course,21 au 28 septembre 2022,"180 034,117 217"
...,...,...,...
8843,Nowhere Man,24 au 31 août 2005,"48 753,17 961"
8844,11'e 10 kala (10 to 11),13 au 20 avril 2011,794
8845,Seules sur la terre,18 au 25 octobre 2006,"81 274,50 760"
8846,"Hollywood, California",05 au 12 février 2020,83
8847,Aynehaye Rooberoo,13 au 20 mai 2015,"14 181,7 222"

In [27]:
import pandas as pd

# Les titres des films que vous avez fournis
print(df2.shape)
titres_films = [
    "Un Noël de folie !",
    "Sex fans des sixties",
    "Bronx à Bel Air",
    "Jonas Brothers : le concert événement 3D",
    "Smart People",
    'Demon Slayer : Kimetsu no Yaiba - En route pour le village des forgerons',
    'Oppenheimer',
    'Barbie',
    'Mission: Impossible – Dead Reckoning Partie 1',
    'Coco',
    'Jack et Julie'
]

# Supposons que vous ayez un DataFrame appelé "df" avec une colonne "Titre"
# Vous pouvez charger ou créer votre DataFrame ici
# Exemple :
# df = pd.read_csv('votre_fichier.csv')

# Vérifier si les titres des films existent dans le DataFrame
for titre_film in titres_films:
    if titre_film in df2['Titre'].values:
        print(f"Le film '{titre_film}' YES.")
    else:
        print(f"Le film '{titre_film}' NO.")

(8848, 3)
Le film 'Un Noël de folie !' YES.
Le film 'Sex fans des sixties' YES.
Le film 'Bronx à Bel Air' YES.
Le film 'Jonas Brothers : le concert événement 3D' YES.
Le film 'Smart People' YES.
Le film 'Demon Slayer : Kimetsu no Yaiba - En route pour le village des forgerons' NO.
Le film 'Oppenheimer' NO.
Le film 'Barbie' NO.
Le film 'Mission: Impossible – Dead Reckoning Partie 1' YES.
Le film 'Coco' YES.
Le film 'Jack et Julie' YES.

In [28]:
df2['Entrées'] = df2['Entrées'].str.replace(' ', '')
df2[['Entrées_1', 'Entrées_2']] = df2['Entrées'].str.split(',', expand=True)
df2['Entrées_1'] = pd.to_numeric(df2['Entrées_1'], errors='coerce').astype('Int64')
df2['Entrées_2'] = pd.to_numeric(df2['Entrées_2'], errors='coerce').astype('Int64')

In [29]:
# Fonction personnalisée pour appliquer les conditions
def calc_entrées(row):
    if pd.notnull(row['Entrées_2']):
        if row['Entrées_2'] > 7 * row['Entrées_1']:
            return row['Entrées_2']
        else:
            return row['Entrées_1']
    return row['Entrées_1']

# Appliquer la fonction pour créer la nouvelle colonne 'Entrées_1ère_semaine'
df2['Entrées_1ère_semaine'] = df2.apply(calc_entrées, axis=1)

In [30]:
df2[df2['Entrées_1ère_semaine']> 4000000]

,Titre,Semaine,Entrées,Entrées_1,Entrées_2,Entrées_1ère_semaine
292,Bienvenue chez les Ch'tis,20 au 27 février 2008,"555392,4378720",555392,4378720,4378720

In [31]:
df2 = df2[['Titre', 'Semaine', 'Entrées_1ère_semaine']]

In [32]:
df2.to_csv('allocine_titre_semaine_entrees_gold.csv', index=False)

In [33]:
df2['Semaine'].isna().count()

8848